In [1]:
print("Hello world!")

Hello world!

In [2]:
x = 5

In [3]:
print(x)

5

In [4]:
x = 6

# Overskrift

## Underoverskrift

Dette er vanlig tekst.

Ny linje

* Bullet points

# Oppslagsverk

* dictionaries
* nøkkel-verdi par

In [5]:
oppslagsverk = {"a":1, "b":2, "c":3}

In [6]:
oppslagsverk["a"]

1

In [7]:
list(oppslagsverk)

['a', 'b', 'c']

In [8]:
len(oppslagsverk)

3

In [9]:
oppslagsverk["d"] = 4

In [10]:
list(oppslagsverk)

['a', 'b', 'c', 'd']

In [11]:
del(oppslagsverk["b"])

In [12]:
list(oppslagsverk)

['a', 'c', 'd']

In [13]:
"a" in oppslagsverk

True

In [14]:
"b" not in oppslagsverk

True

In [15]:
B737 = {"navn":"Boeing 737-800", "passasjerer":189, "vingespenn":34.3, "tow":79 }
A320 = {"navn":"Airbus A320", "passasjerer":150, "vingespenn":35.8, "tow":78 }
B747 = {"navn":"Boeing 747-8","passasjerer":467, "vingespenn":68.4, "tow":448 }
E190 = {"navn":"Embraer E190", "passasjerer":114, "vingespenn":28.7, "tow":51}


flymodeller = {
    "B737":B737,
    "A320":A320,
    "B747":B747,
    "E190":E190
}

In [16]:
flymodeller["B737"]

{'navn': 'Boeing 737-800', 'passasjerer': 189, 'vingespenn': 34.3, 'tow': 79}

In [17]:
flymodeller["B737"]["passasjerer"]

189

In [20]:
total_vingespenn = 0

for fly in flymodeller:
    #print(fly)
    print(flymodeller[fly]["vingespenn"])
    #total_vingespenn = total_vingespenn + flymodeller[fly]["vingespenn"]
    total_vingespenn += flymodeller[fly]["vingespenn"]
    
gjennomsnitt_vingespenn = total_vingespenn/len(flymodeller)

print(f"Gjennomsnittlig vingespenn = {gjennomsnitt_vingespenn} m")

34.3
35.8
68.4
28.7
Gjennomsnittlig vingespendd = 41.8 m

# Funksjon

* argument, å kalle på, returverdi
* keyword argument

In [22]:
x = len(flymodeller)

In [24]:
y = print(x)

4

In [25]:
print(y)

None

In [30]:
print("Dette er en linje", end="\n\n")
print("Dette er en ny linje")

Dette er en linje

Dette er en ny linje

```def funksjonsnavn(argumenter):
    ...
    return returverdi```

In [34]:
def fot_til_meter(lengde_i_fot=1):
    
    lengde_i_meter = lengde_i_fot * 0.3048
    
    return lengde_i_meter

In [32]:
lengde_i_m = fot_til_meter(3)

print(f"{3} fot = {lengde_i_m} m")

3 fot = 0.9144000000000001 m

In [35]:
fot_til_meter()

0.3048

In [36]:
fot_til_meter(1)

0.3048

# Pandas

In [37]:
flymodeller

{'B737': {'navn': 'Boeing 737-800',
  'passasjerer': 189,
  'vingespenn': 34.3,
  'tow': 79},
 'A320': {'navn': 'Airbus A320',
  'passasjerer': 150,
  'vingespenn': 35.8,
  'tow': 78},
 'B747': {'navn': 'Boeing 747-8',
  'passasjerer': 467,
  'vingespenn': 68.4,
  'tow': 448},
 'E190': {'navn': 'Embraer E190',
  'passasjerer': 114,
  'vingespenn': 28.7,
  'tow': 51}}

In [38]:
import pandas as pd

In [41]:
df = pd.DataFrame.from_dict(flymodeller, orient="index")

In [42]:
df

                navn  passasjerer  vingespenn  tow
B737  Boeing 737-800          189        34.3   79
A320     Airbus A320          150        35.8   78
B747    Boeing 747-8          467        68.4  448
E190    Embraer E190          114        28.7   51

In [43]:
df["navn"]

B737    Boeing 737-800
A320       Airbus A320
B747      Boeing 747-8
E190      Embraer E190
Name: navn, dtype: object

In [44]:
df["navn"]["A320"]

'Airbus A320'

In [45]:
df.loc["A320"]

navn           Airbus A320
passasjerer            150
vingespenn            35.8
tow                     78
Name: A320, dtype: object

In [46]:
df.loc["A320"]["navn"]

'Airbus A320'

In [47]:
df.iloc[1]

navn           Airbus A320
passasjerer            150
vingespenn            35.8
tow                     78
Name: A320, dtype: object

In [48]:
df.columns

Index(['navn', 'passasjerer', 'vingespenn', 'tow'], dtype='object')

In [49]:
df.dtypes

navn            object
passasjerer      int64
vingespenn     float64
tow              int64
dtype: object

In [50]:
df.mean()

passasjerer    230.0
vingespenn      41.8
tow            164.0
dtype: float64

In [51]:
df.max()

navn           Embraer E190
passasjerer             467
vingespenn             68.4
tow                     448
dtype: object

In [52]:
df.min()

navn           Airbus A320
passasjerer            114
vingespenn            28.7
tow                     51
dtype: object

In [55]:
index_max_vingespenn = df["vingespenn"].idxmax()

In [57]:
df.loc[index_max_vingespenn]["navn"]

'Boeing 747-8'

In [58]:
df

                navn  passasjerer  vingespenn  tow
B737  Boeing 737-800          189        34.3   79
A320     Airbus A320          150        35.8   78
B747    Boeing 747-8          467        68.4  448
E190    Embraer E190          114        28.7   51

In [59]:
df["tow"]*1000

B737     79000
A320     78000
B747    448000
E190     51000
Name: tow, dtype: int64

In [60]:
df["tow_kg"] = df["tow"]*1000

In [61]:
df

                navn  passasjerer  vingespenn  tow  tow_kg
B737  Boeing 737-800          189        34.3   79   79000
A320     Airbus A320          150        35.8   78   78000
B747    Boeing 747-8          467        68.4  448  448000
E190    Embraer E190          114        28.7   51   51000

In [64]:
df.loc["B747", "tow"] = 70

In [65]:
A321 = {"navn":"Airbus A321", "passasjerer":194, "vingespenn":351, "tow":89,"tow_kg":89000}

In [66]:
df

                navn  passasjerer  vingespenn  tow  tow_kg
B737  Boeing 737-800          189        34.3   79   79000
A320     Airbus A320          150        35.8   78   78000
B747    Boeing 747-8          467        68.4   70  448000
E190    Embraer E190          114        28.7   51   51000

In [71]:
A321 = pd.Series(A321, name="A321")

df = df.append(A321)

                navn  passasjerer  vingespenn  tow  tow_kg
B737  Boeing 737-800          189        34.3   79   79000
A320     Airbus A320          150        35.8   78   78000
B747    Boeing 747-8          467        68.4   70  448000
E190    Embraer E190          114        28.7   51   51000
A321     Airbus A321          194       351.0   89   89000

In [70]:
df

                navn  passasjerer  vingespenn  tow  tow_kg
B737  Boeing 737-800          189        34.3   79   79000
A320     Airbus A320          150        35.8   78   78000
B747    Boeing 747-8          467        68.4   70  448000
E190    Embraer E190          114        28.7   51   51000

In [72]:
flights = pd.read_csv("M1_final.csv")

In [73]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28820 entries, 0 to 28819
Data columns (total 23 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   MONTH              28820 non-null  int64
 1   DAY_OF_MONTH       28820 non-null  int64
 2   DAY_OF_WEEK        28820 non-null  int64
 3   OP_UNIQUE_CARRIER  28820 non-null  object
 4   TAIL_NUM           28820 non-null  object
 5   DEST               28820 non-null  object
 6   DEP_DELAY          28820 non-null  int64
 7   CRS_ELAPSED_TIME   28820 non-null  int64
 8   DISTANCE           28820 non-null  int64
 9   CRS_DEP_M          28820 non-null  int64
 10  DEP_TIME_M         28820 non-null  int64
 11  CRS_ARR_M          28820 non-null  int64
 12  Temperature        28820 non-null  int64
 13  Dew Point          28820 non-null  object
 14  Humidity           28820 non-null  int64
 15  Wind               28818 non-null  object
 16  Wind Speed         28820 non-null  int64
 17  Wind Gust          28820 non-null  int64
 18  Pressure           28820 non-null  float64
 19  Condition          28820 non-null  object
 20  sch_dep            28820 non-null  int64
 21  sch_arr            28820 non-null  int64
 22  TAXI_OUT           28820 non-null  int64
dtypes: float64(1), int64(16), object(6)
memory usage: 5.1+ MB

In [75]:
flights.head(3)

,MONTH,DAY_OF_MONTH,DAY_OF_WEEK,OP_UNIQUE_CARRIER,TAIL_NUM,DEST,DEP_DELAY,CRS_ELAPSED_TIME,DISTANCE,CRS_DEP_M,...,Dew Point,Humidity,Wind,Wind Speed,Wind Gust,Pressure,Condition,sch_dep,sch_arr,TAXI_OUT
0,11,1,5,B6,N828JB,CHS,-1,124,636,324,...,34,58,W,25,38,29.86,Fair / Windy,9,17,14
1,11,1,5,B6,N992JB,LAX,-7,371,2475,340,...,34,58,W,25,38,29.86,Fair / Windy,9,17,15
2,11,1,5,B6,N959JB,FLL,40,181,1069,301,...,34,58,W,25,38,29.86,Fair / Windy,9,17,22

In [76]:
df2 = flights[["MONTH", "DEST", "DISTANCE"]]

In [77]:
df2

       MONTH DEST  DISTANCE
0         11  CHS       636
1         11  LAX      2475
2         11  FLL      1069
3         11  MCO       944
4         11  ATL       760
...      ...  ...       ...
28815      1  ORH       150
28816      1  BOS       187
28817      1  SEA      2422
28818      1  SJU      1598
28819      1  BQN      1576

[28820 rows x 3 columns]

In [78]:
df2 = df2.set_axis(["Month", "Destination", "Distance"], axis="columns")

In [79]:
df2.groupby("Month").sum()

       Distance
Month
1      12516398
11     12347964
12     11672080

In [82]:
df2.groupby("Month").sum()["Distance"].idxmax()

1